// X班 complex.c

#include "complex.h"

#include <math.h>
#include <stdio.h>

// テスト作成者は雛形までを作成し、コンパイルができるまでを責任とします。
// コンパイルができたところで、コミットしてください。

//////////////////////////////////////////////////////////////////////////////////////////

//↓↓↓↓ 3327 中野光喜 記述部(雛形まで。この範囲以外には追加しない)

//↑↑↑↑ ここまでを 3327 中野光喜 が記述(この範囲以外には追加しない)

//////////////////////////////////////////////////////////////////////////////////////////

//↓↓↓↓ 3328 西口豪志 記述部(雛形まで。この範囲以外には追加しない)

complex makeComp(double real, double image) {
    complex ans;
    ans.real = real ;
    ans.image = image;
    return ans;
}


//↑↑↑↑ ここまでを 3328 西口豪志 が記述(この範囲以外には追加しない)

//////////////////////////////////////////////////////////////////////////////////////////


// ここから下には何も追記しないでください。