// X班 complex.c

#include "complex.h"

#include <math.h>
#include <stdio.h>

// テスト作成者は雛形までを作成し、コンパイルができるまでを責任とします。
// コンパイルができたところで、コミットしてください。

//////////////////////////////////////////////////////////////////////////////////////////

//↓↓↓↓ 3327 中野光喜 記述部(雛形まで。この範囲以外には追加しない)
<<<<<<< HEAD

//↑↑↑↑ ここまでを 3327 中野光喜 が記述(この範囲以外には追加しない)
=======
complex makeCompRT(double r, double theta){
    complex ans;
    ans.real = r * cos(theta);
    ans.image = r * sin(theta);
    return makeComp(0.0, 0.0);
}
//↑↑↑↑ ここまでを 33xx XXXX が記述(この範囲以外には追加しない)
>>>>>>> b879d474428f8ed2077e3c565c9e53bcf7042be8

//////////////////////////////////////////////////////////////////////////////////////////

//↓↓↓↓ 3328 西口豪志 記述部(雛形まで。この範囲以外には追加しない)

complex makeComp(double real, double image) {
    complex ans;
    ans.real = real ;
    ans.image = image;
    return ans;
}


//↑↑↑↑ ここまでを 3328 西口豪志 が記述(この範囲以外には追加しない)

//////////////////////////////////////////////////////////////////////////////////////////


// ここから下には何も追記しないでください。