#ifndef __COMPLEX_H__
#define __COMPLEX_H__

// 二重読み込みを防ぐために、complex 構造体の定義などはここに記述

// ↓↓↓↓ complex の定義 by 33aa AAAA

//↑↑↑↑ ここまでを 33aa AAAA が記述

//////////////////////////////////////////////////////////////////////////////////////////

// プロトタイプ宣言部
//↓↓↓↓ 3327 中野光喜 記述部(この範囲以外に追加しない)



//↑↑↑↑ ここまでを 3327 中野光喜 が記述(この範囲以外に追加しない)

//////////////////////////////////////////////////////////////////////////////////////////

//↓↓↓↓ 3328 西口豪志 記述部(この範囲以外に追加しない)

 complex makeComp(real , image);


//↑↑↑↑ ここまでを 3328 西口豪志 が記述(この範囲以外に追加しない)



// ここから下には何も追記しないでください。

#endif